Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteInvisible
Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics.